Muhammed-Alessa/stm32-lab-projects/Project 55 - X-NUCLEO-OUT01A1 - Flashing an LED/main.c
/*
 * X-NUCLEO-OUT01A1 - Flashing an LED
 * Target: NUCLEO-F446RE / STM32F446RET6
 * Framework: STM32CubeF4 HAL
 *
 * Independently rewritten for the F446RE board.
 * This is not a copy of the book's program listing.
 */
#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>


static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = {0};
    RCC_ClkInitTypeDef clk = {0};

    __HAL_RCC_PWR_CLK_ENABLE();

    osc.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc.HSIState = RCC_HSI_ON;
    osc.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    osc.PLL.PLLState = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
        while (1) {}
    }

    clk.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                    RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk.APB1CLKDivider = RCC_HCLK_DIV1;
    clk.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_0) != HAL_OK) {
        while (1) {}
    }
}

/*
 * Expansion-board project.
 *
 * Create the NUCLEO-F446RE project in STM32CubeIDE, install/select the BSP or
 * X-CUBE package matching your exact expansion-board revision, then place the
 * application logic in USER CODE sections.
 *
 * The expansion-board middleware API can change between package versions, so
 * this repository intentionally does not invent a fixed BSP function name.
 */
int main(void)
{
    HAL_Init(); SystemClock_Config();
    /* Initialize the expansion-board BSP/X-CUBE component here. */
    while (1) { HAL_Delay(1000); }
}
